In [30]:
import pandas as pd

# Create DataFrame

In [40]:
df = pd.DataFrame([
    ['1', 'Henri', 25, False],
    ['2', 'Laura', 30, True],
    ['3', 'David', 45, True],
    ['4', 'Emma', 32, False],
])
df.columns = ['id', 'name', 'age', 'mariage']
print(df)
print(type(df))

  id   name  age  mariage
0  1  Henri   25    False
1  2  Laura   30     True
2  3  David   45     True
3  4   Emma   32    False
<class 'pandas.core.frame.DataFrame'>

# Select column

In [41]:
a = df[["name", "age"]]
print(a)
print(type(a))

    name  age
0  Henri   25
1  Laura   30
2  David   45
3   Emma   32
<class 'pandas.core.frame.DataFrame'>

In [42]:
a = df["name"]
print(a)
print(type(a))

0    Henri
1    Laura
2    David
3     Emma
Name: name, dtype: object
<class 'pandas.core.series.Series'>

In [43]:
a = df.name
print(a)
print(type(a))

0    Henri
1    Laura
2    David
3     Emma
Name: name, dtype: object
<class 'pandas.core.series.Series'>

In [44]:
a = df.iloc[:,3]
print(a)
print(type(a))

0    False
1     True
2     True
3    False
Name: mariage, dtype: bool
<class 'pandas.core.series.Series'>

In [45]:
a = df.iloc[:,[3]]
print(a)
print(type(a))

   mariage
0    False
1     True
2     True
3    False
<class 'pandas.core.frame.DataFrame'>

In [46]:
b = df.iloc[:,2:]
print(b)
print(type(b))

   age  mariage
0   25    False
1   30     True
2   45     True
3   32    False
<class 'pandas.core.frame.DataFrame'>

# Select rows

In [47]:
df.iloc[1:3,:]

  id   name  age  mariage
1  2  Laura   30     True
2  3  David   45     True

In [49]:
df[df.age>30]

  id   name  age  mariage
2  3  David   45     True
3  4   Emma   32    False

In [50]:
df[(df.age>30)&(df.mariage==True)]

  id   name  age  mariage
2  3  David   45     True